#### AnalyticalCurveSelector Enumeration

---

|  |
| --- |
| See Also |

Specifies which portion of an Analytical Curve is of interest.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AnalyticalCurveSelector ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyticalCurveSelector ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyticalCurveSelector ``` |

# Members

| Member name | Description |
| --- | --- |
| StartPoint | Start of curve (corresponds to end = 0). |
| EndPoint | End of curve (corresponds to end = 1). |
| WholeCurve | Entire curve. |

# See Also

Autodesk.Revit.DB.Structure Namespace